#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.6`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Reading...[0m[0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Read complete after 1s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mazurerm_resource_group.resource_group: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/myshir-dev-shir-rg][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mazurerm_data_factory.data_factory: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/myshir-dev-shir-rg/providers/Microsoft.DataFactory/factories/myshir-dev-adf001][0m
[0m[1mmodule.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/myshir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/myshir-dev-kv001][0m
[0m[1mmodule.user_assigned_identity.azurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/myshir-dev-shir-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/myshir-dev-uai001][0m
[0m[1mmodule.app_service_plan.azurerm_service_plan.service_plan: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/myshir-dev-shir-rg/providers/Microsoft.Web/serverFarms/myshir-dev-asp001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mazapi_resource.subnet_container: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/ContainerSubnetShir][0m
[0m[1mmodule.app_service_plan.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Reading...[0m[0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_data_factory: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/myshir-dev-shir-rg/providers/Microsoft.DataFactory/factories/myshir-dev-adf001|logAnalytics][0m
[0m[1mmodule.app_service_plan.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/myshir-dev-shir-rg/providers/Microsoft.Web/serverFarms/myshir-dev-asp001][0m
[0m[1mmodule.app_service_plan.azurerm_monitor_diagnostic_setting.diagnostic_setting_service_plan["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/myshir-dev-shir-rg/providers/Microsoft.Web/serverFarms/myshir-dev-asp001|applicationLogs-0][0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mmodule.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/myshir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/myshir-dev-kv001/providers/Microsoft.Authorization/roleAssignments/7bfb52c5-6b7f-96c5-3348-a519ea95952a][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_key_vault_secrets_user: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/myshir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/myshir-dev-kv001/providers/Microsoft.Authorization/roleAssignments/d7864dc3-5c69-2ee5-07bc-28d59288658c][0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/myshir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/myshir-dev-kv001][0m
[0m[1mmodule.key_vault.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/myshir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/myshir-dev-kv001|applicationLogs-0][0m
[0m[1mazapi_resource.subnet_private_endpoints: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/PrivateEndpointSubnetShir][0m
[0m[1mazurerm_private_endpoint.data_factory_private_endpoint: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/myshir-dev-shir-rg/providers/Microsoft.Network/privateEndpoints/myshir-dev-adf001-pe][0m
[0m[1mmodule.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/myshir-dev-shir-rg/providers/Microsoft.Network/privateEndpoints/myshir-dev-kv001-vault-pe][0m
[0m[1mazurerm_data_factory_integration_runtime_self_hosted.data_factory_integration_runtime_self_hosted: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/myshir-dev-shir-rg/providers/Microsoft.DataFactory/factories/myshir-dev-adf001/integrationruntimes/SelfhostedIntegrationRuntime001][0m
[0m[1mmodule.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2025-03-09T18:02:52Z][0m
[0m[1mazurerm_key_vault_secret.key_vault_secret_shir_key: Refreshing state... [id=https://myshir-dev-kv001.vault.azure.net/secrets/datafactory-shir-auth-key/bfacef4ec8464e31a0ecd5092068319b][0m
[0m[1mazurerm_windows_web_app.windows_web_app: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/myshir-dev-shir-rg/providers/Microsoft.Web/sites/myshir-dev-asp001][0m
[0m[1mazurerm_private_endpoint.windows_web_app_private_endpoint: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/myshir-dev-shir-rg/providers/Microsoft.Network/privateEndpoints/myshir-dev-asp001-pe][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_windows_web_app: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/myshir-dev-shir-rg/providers/Microsoft.Web/sites/myshir-dev-asp001|logAnalytics][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_data_factory[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_data_factory" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/myshir-dev-shir-rg/providers/Microsoft.DataFactory/factories/myshir-dev-adf001"
    }

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_windows_web_app[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_windows_web_app" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/myshir-dev-shir-rg/providers/Microsoft.Web/sites/myshir-dev-asp001"
    }

[1m  # azurerm_data_factory.data_factory[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_data_factory" "data_factory" {
        id                               = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/myshir-dev-shir-rg/providers/Microsoft.DataFactory/factories/myshir-dev-adf001"
        name                             = "myshir-dev-adf001"
      [33m~[0m[0m public_network_enabled           = true [33m->[0m[0m false
      [33m~[0m[0m tags                             = {
          [32m+[0m[0m "workload" = "shir-runners"
        }
        [90m# (6 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # azurerm_data_factory_integration_runtime_self_hosted.data_factory_integration_runtime_self_hosted[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_data_factory_integration_runtime_self_hosted" "data_factory_integration_runtime_self_hosted" {
        id                                           = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/myshir-dev-shir-rg/providers/Microsoft.DataFactory/factories/myshir-dev-adf001/integrationruntimes/SelfhostedIntegrationRuntime001"
        name                                         = "SelfhostedIntegrationRuntime001"
      [31m-[0m[0m self_contained_interactive_authoring_enabled = true [90m-> null[0m[0m
        [90m# (4 unchanged attributes hidden)[0m[0m
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_data_factory[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_data_factory" {
        id                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/myshir-dev-shir-rg/providers/Microsoft.DataFactory/factories/myshir-dev-adf001|logAnalytics"
        name                           = "logAnalytics"
        [90m# (5 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "allLogs" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m metric (known after apply)
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_windows_web_app[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_windows_web_app" {
        id                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/myshir-dev-shir-rg/providers/Microsoft.Web/sites/myshir-dev-asp001|logAnalytics"
        name                           = "logAnalytics"
        [90m# (5 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "allLogs" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "audit" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m metric (known after apply)
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
    }

[1m  # azurerm_windows_web_app.windows_web_app[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_windows_web_app" "windows_web_app" {
      [33m~[0m[0m app_settings                                   = {
          [33m~[0m[0m "AUTH_KEY"                            = "IR@911cb5d2-6d48-4994-b04b-981a329b89c5@myshir-dev-adf001@ServiceEndpoint=myshir-dev-adf001.northeurope.datafactory.azure.net@/yI0MkBw3yA1TMIFr8kSsZPaHShwhjmKtq1OAwHDVyc=" [33m->[0m[0m "IR@911cb5d2-6d48-4994-b04b-981a329b89c5@myshir-dev-adf001@ServiceEndpoint=myshir-dev-adf001.northeurope.datafactory.azure.net@2O1b2kW5o5gh2f4BN9Bg3IymQe7hZkNBHbcIJgLB9io="
            [90m# (7 unchanged elements hidden)[0m[0m
        }
        id                                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/myshir-dev-shir-rg/providers/Microsoft.Web/sites/myshir-dev-asp001"
        name                                           = "myshir-dev-asp001"
      [33m~[0m[0m public_network_access_enabled                  = true [33m->[0m[0m false
        tags                                           = {
            "workload" = "shir-runners"
        }
        [90m# (23 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m site_config {
            [90m# (29 unchanged attributes hidden)[0m[0m

          [33m~[0m[0m application_stack {
              [33m~[0m[0m docker_image_name            = (sensitive value)
                [90m# (14 unchanged attributes hidden)[0m[0m
            }
        }

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1mPlan:[0m 0 to add, 5 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>